# read design 
read_verilog AdderMini.v

# elaborate design hierarchy
hierarchy -check -top AdderMini

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping logic to gates. I'm not sure but fast option seems to be necessary to get correct circuit.
abc -g gates,MUX -fast

# cleanup
clean -purge

# write synthesized design
write_json AdderMini.json

#check output circuit
show