# read design 
read_verilog StateMachine.v

# elaborate design hierarchy
hierarchy -check -top StateMachine

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

#To make easy to parse for V2TT
flatten;

# mapping logic to gates.
abc -g gates,MUX

# cleanup
clean -purge

# write synthesized design
write_json StateMachine.json

#check output circuit
show -prefix StateMachine -format svg
