# read design 
read_verilog Adder32bit.v

# elaborate design hierarchy
hierarchy -check -top Adder32bit

#delete constants
opt_expr; opt_clean;

#detect error
check

#map adder
wreduce; alumacc;

# the high-level stuff
share; proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping logic to gates.
abc -g gates,MUX

# cleanup
clean -purge

# write synthesized design
write_json circuit.json

#check output circuit
show -prefix circuit -format svg